/*
𝖆𝖇𝖈𝖉𝖊𝖋𝖌𝖍𝖎𝖏𝖐𝖑𝖒𝖓𝖔𝖕𝖖𝖗𝖘𝖙𝖚𝖛𝖜𝖝𝖞𝖟
𝕬𝕭𝕮𝕯𝕰𝕱𝕲𝕳𝕴𝕵𝕶𝕷𝕸𝕹𝕺𝕻𝕼𝕽𝕾𝕿𝖀𝖁𝖂𝖃𝖄𝖅
*/

𝕺𝖇𝖏𝖊𝖈𝖙 = Object;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊 = 𝕺𝖇𝖏𝖊𝖈𝖙.prototype;

𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖆𝖕𝖕𝖑𝖞 = 𝕺𝖇𝖏𝖊𝖈𝖙.apply;
// 𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖆𝖗𝖌𝖚𝖒𝖊𝖓𝖙𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.arguments;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖆𝖘𝖘𝖎𝖌𝖓 = 𝕺𝖇𝖏𝖊𝖈𝖙.assign;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖇𝖎𝖓𝖉 = 𝕺𝖇𝖏𝖊𝖈𝖙.bind;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖈𝖆𝖑𝖑 = 𝕺𝖇𝖏𝖊𝖈𝖙.call;
// 𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖈𝖆𝖑𝖑𝖊𝖗 = 𝕺𝖇𝖏𝖊𝖈𝖙.caller;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖈𝖔𝖓𝖘𝖙𝖗𝖚𝖈𝖙𝖔𝖗 = 𝕺𝖇𝖏𝖊𝖈𝖙.constructor;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖈𝖗𝖊𝖆𝖙𝖊 = 𝕺𝖇𝖏𝖊𝖈𝖙.create;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖉𝖊𝖋𝖎𝖓𝖊𝕻𝖗𝖔𝖕𝖊𝖗𝖙𝖎𝖊𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.defineProperties;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖉𝖊𝖋𝖎𝖓𝖊𝕻𝖗𝖔𝖕𝖊𝖗𝖙𝖞 = 𝕺𝖇𝖏𝖊𝖈𝖙.defineProperty;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖊𝖓𝖙𝖗𝖎𝖊𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.entries;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖋𝖗𝖊𝖊𝖟𝖊 = 𝕺𝖇𝖏𝖊𝖈𝖙.freeze;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖌𝖊𝖙𝕺𝖜𝖓𝕻𝖗𝖔𝖕𝖊𝖗𝖙𝖞𝕯𝖊𝖘𝖈𝖗𝖎𝖕𝖙𝖔𝖗 = 𝕺𝖇𝖏𝖊𝖈𝖙.getOwnPropertyDescriptor;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖌𝖊𝖙𝕺𝖜𝖓𝕻𝖗𝖔𝖕𝖊𝖗𝖙𝖞𝕯𝖊𝖘𝖈𝖗𝖎𝖕𝖙𝖔𝖗𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.getOwnPropertyDescriptors;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖌𝖊𝖙𝕺𝖜𝖓𝕻𝖗𝖔𝖕𝖊𝖗𝖙𝖞𝕹𝖆𝖒𝖊𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.getOwnPropertyNames;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖌𝖊𝖙𝕺𝖜𝖓𝕻𝖗𝖔𝖕𝖊𝖗𝖙𝖞𝕾𝖞𝖒𝖇𝖔𝖑𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.getOwnPropertySymbols;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖌𝖊𝖙𝕻𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊𝕺𝖋 = 𝕺𝖇𝖏𝖊𝖈𝖙.getPrototypeOf;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖍𝖆𝖘𝕺𝖜𝖓𝕻𝖗𝖔𝖕𝖊𝖗𝖙𝖞 = 𝕺𝖇𝖏𝖊𝖈𝖙.hasOwnProperty;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖎𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.is;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖎𝖘𝕰𝖝𝖙𝖊𝖓𝖘𝖎𝖇𝖑𝖊 = 𝕺𝖇𝖏𝖊𝖈𝖙.isExtensible;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖎𝖘𝕱𝖗𝖔𝖟𝖊𝖓 = 𝕺𝖇𝖏𝖊𝖈𝖙.isFrozen;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖎𝖘𝕻𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊𝕺𝖋 = 𝕺𝖇𝖏𝖊𝖈𝖙.isPrototypeOf;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖎𝖘𝕾𝖊𝖆𝖑𝖊𝖉 = 𝕺𝖇𝖏𝖊𝖈𝖙.isSealed;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖐𝖊𝖞𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.keys;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖑𝖊𝖓𝖌𝖙𝖍 = 𝕺𝖇𝖏𝖊𝖈𝖙.length;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖓𝖆𝖒𝖊 = '𝕺𝖇𝖏𝖊𝖈𝖙';
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖕𝖗𝖊𝖛𝖊𝖓𝖙𝕰𝖝𝖙𝖊𝖓𝖘𝖎𝖔𝖓𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.preventExtensions;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖕𝖗𝖔𝖕𝖊𝖗𝖙𝖞𝕴𝖘𝕰𝖓𝖚𝖒𝖊𝖗𝖆𝖇𝖑𝖊 = 𝕺𝖇𝖏𝖊𝖈𝖙.propertyIsEnumerable;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖘𝖊𝖆𝖑 = 𝕺𝖇𝖏𝖊𝖈𝖙.seal;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖘𝖊𝖙𝕻𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊𝕺𝖋 = 𝕺𝖇𝖏𝖊𝖈𝖙.setPrototypeOf;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖙𝖔𝕾𝖙𝖗𝖎𝖓𝖌 = 𝕺𝖇𝖏𝖊𝖈𝖙.toString;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖙𝖔𝕷𝖔𝖈𝖆𝖑𝖊𝕾𝖙𝖗𝖎𝖓𝖌 = 𝕺𝖇𝖏𝖊𝖈𝖙.toLocaleString;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖛𝖆𝖑𝖚𝖊𝖘 = 𝕺𝖇𝖏𝖊𝖈𝖙.values;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.𝖛𝖆𝖑𝖚𝖊𝕺𝖋 = 𝕺𝖇𝖏𝖊𝖈𝖙.valueOf;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.__𝖉𝖊𝖋𝖎𝖓𝖊𝕲𝖊𝖙𝖙𝖊𝖗__ = 𝕺𝖇𝖏𝖊𝖈𝖙.__defineGetter__;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.__𝖉𝖊𝖋𝖎𝖓𝖊𝕾𝖊𝖙𝖙𝖊𝖗__ = 𝕺𝖇𝖏𝖊𝖈𝖙.__defineSetter__;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.__𝖑𝖔𝖔𝖐𝖚𝖕𝕲𝖊𝖙𝖙𝖊𝖗__ = 𝕺𝖇𝖏𝖊𝖈𝖙.__defineGetter__;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.__𝖑𝖔𝖔𝖐𝖚𝖕𝕾𝖊𝖙𝖙𝖊𝖗__ = 𝕺𝖇𝖏𝖊𝖈𝖙.__defineSetter__;
𝕺𝖇𝖏𝖊𝖈𝖙.𝖕𝖗𝖔𝖙𝖔𝖙𝖞𝖕𝖊.__𝖕𝖗𝖔𝖙𝖔__ = 𝕺𝖇𝖏𝖊𝖈𝖙.__proto__;
